# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\marthnick\Desktop\firm_F1-TestFixture\F1-TestFixture.cydsn\F1-TestFixture.cyprj
# Date: Wed, 30 Dec 2020 21:31:29 GMT
#set_units -time ns
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {CyDividedClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 48001 96001} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {UART_460800_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 13 27} -nominal_period 270.83333333333331 [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {UART_230400_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 27 53} -nominal_period 541.66666666666663 [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {ADC_AudioStream_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 31 61} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {UART_115200_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 53 105} -nominal_period 1083.3333333333333 [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {timer_clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 481 961} [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {timer_clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2001 4001} -nominal_period 41666.666666666664 [list [get_pins {ClockBlock/dclk_glb_5}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\marthnick\Desktop\firm_F1-TestFixture\F1-TestFixture.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\marthnick\Desktop\firm_F1-TestFixture\F1-TestFixture.cydsn\F1-TestFixture.cyprj
# Date: Wed, 30 Dec 2020 21:31:15 GMT
